AWS_RedisCluster/6_redis/4Stress_hdd4.txt
====== PING_INLINE ======
  100000 requests completed in 7.50 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
5.45% <= 2 milliseconds
28.21% <= 3 milliseconds
61.21% <= 4 milliseconds
87.07% <= 5 milliseconds
97.23% <= 6 milliseconds
99.61% <= 7 milliseconds
99.89% <= 8 milliseconds
99.92% <= 9 milliseconds
99.93% <= 10 milliseconds
99.95% <= 11 milliseconds
99.95% <= 12 milliseconds
99.95% <= 13 milliseconds
99.97% <= 14 milliseconds
99.98% <= 15 milliseconds
99.99% <= 16 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
100.00% <= 208 milliseconds
13335.11 requests per second

====== PING_BULK ======
  100000 requests completed in 7.16 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
6.17% <= 2 milliseconds
32.95% <= 3 milliseconds
67.77% <= 4 milliseconds
90.50% <= 5 milliseconds
98.15% <= 6 milliseconds
99.73% <= 7 milliseconds
99.92% <= 8 milliseconds
99.97% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 203 milliseconds
100.00% <= 208 milliseconds
13970.38 requests per second

====== SET ======
  100000 requests completed in 7.94 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
4.92% <= 2 milliseconds
23.55% <= 3 milliseconds
56.10% <= 4 milliseconds
83.76% <= 5 milliseconds
96.16% <= 6 milliseconds
99.24% <= 7 milliseconds
99.76% <= 8 milliseconds
99.88% <= 9 milliseconds
99.94% <= 10 milliseconds
99.96% <= 11 milliseconds
99.98% <= 12 milliseconds
99.99% <= 13 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
100.00% <= 206 milliseconds
100.00% <= 213 milliseconds
12596.04 requests per second

====== GET ======
  100000 requests completed in 6.73 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
10.62% <= 2 milliseconds
44.81% <= 3 milliseconds
72.84% <= 4 milliseconds
91.06% <= 5 milliseconds
97.82% <= 6 milliseconds
99.64% <= 7 milliseconds
99.90% <= 8 milliseconds
99.98% <= 9 milliseconds
99.98% <= 10 milliseconds
100.00% <= 206 milliseconds
14856.63 requests per second

====== INCR ======
  100000 requests completed in 6.55 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
7.57% <= 2 milliseconds
47.40% <= 3 milliseconds
82.29% <= 4 milliseconds
95.35% <= 5 milliseconds
99.11% <= 6 milliseconds
99.79% <= 7 milliseconds
99.90% <= 8 milliseconds
99.92% <= 9 milliseconds
99.96% <= 10 milliseconds
99.99% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 14 milliseconds
100.00% <= 203 milliseconds
100.00% <= 209 milliseconds
15264.84 requests per second

====== LPUSH ======
  100000 requests completed in 6.40 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
8.11% <= 2 milliseconds
50.60% <= 3 milliseconds
84.74% <= 4 milliseconds
96.50% <= 5 milliseconds
99.15% <= 6 milliseconds
99.64% <= 7 milliseconds
99.76% <= 8 milliseconds
99.90% <= 9 milliseconds
99.97% <= 10 milliseconds
100.00% <= 206 milliseconds
15634.77 requests per second

====== RPUSH ======
  100000 requests completed in 5.09 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
21.56% <= 2 milliseconds
80.79% <= 3 milliseconds
98.20% <= 4 milliseconds
99.74% <= 5 milliseconds
99.92% <= 6 milliseconds
99.97% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 203 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
19627.09 requests per second

====== LPOP ======
  100000 requests completed in 5.48 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
17.86% <= 2 milliseconds
73.98% <= 3 milliseconds
95.43% <= 4 milliseconds
98.22% <= 5 milliseconds
98.82% <= 6 milliseconds
99.21% <= 7 milliseconds
99.43% <= 8 milliseconds
99.58% <= 9 milliseconds
99.64% <= 10 milliseconds
99.68% <= 11 milliseconds
99.70% <= 12 milliseconds
99.72% <= 13 milliseconds
99.75% <= 14 milliseconds
99.86% <= 15 milliseconds
99.97% <= 16 milliseconds
100.00% <= 17 milliseconds
100.00% <= 203 milliseconds
18251.51 requests per second

====== RPOP ======
  100000 requests completed in 5.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
14.91% <= 2 milliseconds
68.18% <= 3 milliseconds
94.22% <= 4 milliseconds
98.39% <= 5 milliseconds
99.11% <= 6 milliseconds
99.64% <= 7 milliseconds
99.78% <= 8 milliseconds
99.82% <= 9 milliseconds
99.85% <= 10 milliseconds
99.85% <= 12 milliseconds
99.86% <= 13 milliseconds
99.91% <= 14 milliseconds
99.96% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 16 milliseconds
17680.34 requests per second

====== SADD ======
  100000 requests completed in 6.01 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
16.77% <= 2 milliseconds
63.63% <= 3 milliseconds
86.18% <= 4 milliseconds
94.91% <= 5 milliseconds
98.49% <= 6 milliseconds
99.66% <= 7 milliseconds
99.88% <= 8 milliseconds
99.90% <= 9 milliseconds
99.93% <= 10 milliseconds
99.94% <= 11 milliseconds
99.94% <= 14 milliseconds
99.96% <= 15 milliseconds
99.98% <= 16 milliseconds
100.00% <= 201 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
100.00% <= 206 milliseconds
16650.02 requests per second

====== HSET ======
  100000 requests completed in 7.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
7.02% <= 2 milliseconds
26.24% <= 3 milliseconds
58.26% <= 4 milliseconds
83.23% <= 5 milliseconds
95.21% <= 6 milliseconds
98.87% <= 7 milliseconds
99.62% <= 8 milliseconds
99.87% <= 9 milliseconds
99.97% <= 10 milliseconds
99.99% <= 11 milliseconds
100.00% <= 12 milliseconds
100.00% <= 205 milliseconds
100.00% <= 205 milliseconds
13036.11 requests per second

====== SPOP ======
  100000 requests completed in 5.13 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.08% <= 1 milliseconds
22.00% <= 2 milliseconds
79.46% <= 3 milliseconds
97.37% <= 4 milliseconds
99.17% <= 5 milliseconds
99.69% <= 6 milliseconds
99.92% <= 7 milliseconds
99.98% <= 8 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
100.00% <= 205 milliseconds
19496.98 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 6.35 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
13.10% <= 2 milliseconds
53.88% <= 3 milliseconds
80.20% <= 4 milliseconds
93.16% <= 5 milliseconds
97.94% <= 6 milliseconds
99.29% <= 7 milliseconds
99.74% <= 8 milliseconds
99.87% <= 9 milliseconds
99.91% <= 10 milliseconds
99.95% <= 12 milliseconds
99.95% <= 14 milliseconds
100.00% <= 205 milliseconds
100.00% <= 207 milliseconds
100.00% <= 212 milliseconds
15752.99 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 5.16 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
21.60% <= 2 milliseconds
79.79% <= 3 milliseconds
96.88% <= 4 milliseconds
99.22% <= 5 milliseconds
99.71% <= 6 milliseconds
99.86% <= 7 milliseconds
99.92% <= 8 milliseconds
99.97% <= 9 milliseconds
100.00% <= 202 milliseconds
100.00% <= 204 milliseconds
19394.88 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.26 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
19.39% <= 2 milliseconds
76.22% <= 3 milliseconds
97.13% <= 4 milliseconds
99.70% <= 5 milliseconds
99.88% <= 6 milliseconds
99.94% <= 7 milliseconds
99.96% <= 8 milliseconds
99.98% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 202 milliseconds
100.00% <= 203 milliseconds
100.00% <= 204 milliseconds
100.00% <= 204 milliseconds
19015.02 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 5.29 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
18.46% <= 2 milliseconds
74.97% <= 3 milliseconds
97.01% <= 4 milliseconds
99.69% <= 5 milliseconds
99.91% <= 6 milliseconds
99.97% <= 7 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
18892.88 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 6.35 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
6.97% <= 2 milliseconds
51.65% <= 3 milliseconds
86.63% <= 4 milliseconds
97.15% <= 5 milliseconds
99.27% <= 6 milliseconds
99.72% <= 7 milliseconds
99.87% <= 8 milliseconds
99.93% <= 9 milliseconds
99.93% <= 10 milliseconds
99.94% <= 11 milliseconds
99.95% <= 12 milliseconds
99.95% <= 13 milliseconds
99.95% <= 14 milliseconds
99.96% <= 15 milliseconds
99.98% <= 16 milliseconds
100.00% <= 205 milliseconds
100.00% <= 206 milliseconds
100.00% <= 207 milliseconds
15755.47 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 5.41 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
19.36% <= 2 milliseconds
74.09% <= 3 milliseconds
93.42% <= 4 milliseconds
98.10% <= 5 milliseconds
99.44% <= 6 milliseconds
99.77% <= 7 milliseconds
99.87% <= 8 milliseconds
99.94% <= 9 milliseconds
99.98% <= 10 milliseconds
99.99% <= 11 milliseconds
100.00% <= 203 milliseconds
100.00% <= 204 milliseconds
100.00% <= 204 milliseconds
18484.29 requests per second